#ifndef MAPDATA_H
#define MAPDATA_H

const int num[][7][4]=
{
	{0,1,1,0,1,0,0,1,1,0,0,1,0,0,0,0,1,0,0,1,1,0,0,1,0,1,1,0},//0
	{0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0},//1
	{0,1,1,0,0,0,0,1,0,0,0,1,0,1,1,0,1,0,0,0,1,0,0,0,0,1,1,0},//2
	{0,1,1,0,0,0,0,1,0,0,0,1,0,1,1,0,0,0,0,1,0,0,0,1,0,1,1,0},//3
	{0,0,0,0,1,0,0,1,1,0,0,1,0,1,1,0,0,0,0,1,0,0,0,1,0,0,0,0},//4
	{0,1,1,0,1,0,0,0,1,0,0,0,0,1,1,0,0,0,0,1,0,0,0,1,0,1,1,0},//5
	{0,1,1,0,1,0,0,0,1,0,0,0,0,1,1,0,1,0,0,1,1,0,0,1,0,1,1,0},//6
	{0,1,1,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0},//7
	{0,1,1,0,1,0,0,1,1,0,0,1,0,1,1,0,1,0,0,1,1,0,0,1,0,1,1,0},//8
	{0,1,1,0,1,0,0,1,1,0,0,1,0,1,1,0,0,0,0,1,0,0,0,1,0,1,1,0},//9
	{0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0} //:
},
timx[8]={3,8,12,15,20,12,15,20},
timy[8]={1,1,1,1,1,9,9,9};

const char 
*NaYinWuXing[]=
{"海中金","炉中火","大林木","路边土","剑峰金","山头火", "涧下水","城墙土","白腊金","杨柳木","泉中水","屋上土",
 "霹雷火","松柏木","长流水","沙中金","山下火","平地木",
 "壁上土", "金泊金","佛灯火",  "天河水","大泽土","钗钏金",
 "桑松木", "大溪水","沙中土", "天上火","石榴木","大海水"},
* wday0[]=
{"日", "一", "二", "三", "四", "五", "六"},
*ChDay[] = 
{" -- ",
    "初一","初二","初三","初四","初五",
    "初六","初七","初八","初九","初十",
    "十一","十二","十三","十四","十五",
    "十六","十七","十八","十九","二十",
    "廿一","廿二","廿三","廿四","廿五",
    "廿六","廿七","廿八","廿九","三十"},
*ChMonth[] =
{"--","正","二","三","四","五","六","七","八","九","十","冬","腊"},
*tgan[]=
{"甲","乙","丙","丁","戊","己","庚","辛","壬","癸"},
*dzhi[]=
{"子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"},
*CZodiac[]=
{"鼠","牛","虎","兔","龙","蛇","马","羊","猴","鸡","狗","猪"},
*leapmon[]={"  ","闰"},
*ChSsolarterms0[]=
{"  ----  ", "冬至","小寒","大寒","立春","雨水","惊蛰","春分","清明","谷雨","立夏","小满","芒种","夏至","小暑","大暑","立秋","处暑","白露","秋分","寒露","霜降","立冬","小雪","大雪"};
char* ChSolarterms[]={"        ","\e[32m冬至节 ️ ","\e[37m小寒    ","\e[37m大寒    ","\e[37m立春    ","\e[37m雨水    ","\e[37m惊蛰    ","\e[37m春分    ","\e[32m清明节  ","\e[37m谷雨    ","\e[37m立夏    ","\e[37m小满    ","\e[37m芒种    ","\e[37m夏至    ","\e[37m小暑    ","\e[37m大暑    ","\e[37m立秋    ","\e[37m处暑    ","\e[37m白露    ","\e[37m秋分    ","\e[37m寒露    ","\e[37m霜降    ","\e[37m立冬    ","\e[37m小雪    ","\e[37m大雪    ","\e[32m冬至节  "},
 *ChDay0[] =
  {" １     "," ２     "," ３     "," ４     "," ５     "," ６     "," ７     "," ８     "," ９     ","１０    ","１１    ","１２    ","１３    ","１４    ","１５    ","１６    ","１７    ","１８    ","１９    ","２０    ","２１    ","２２    ","２３    ","２４    ","２５    ","２６    ","２７    ","２８    ","２９    ","３０    ","３１    "},
*ChDay1[] = {"   --   ","\e[33m初一    ","\e[33m初二    ","\e[33m初三    ","\e[33m初四    ","\e[33m初五    ","\e[33m初六    ","\e[33m初七    ","\e[33m初八    ","\e[33m初九    ","\e[33m初十    ","\e[33m十一    ","\e[33m十二    ","\e[33m十三    ","\e[33m十四    ","\e[33m十五    ","\e[33m十六    ","\e[33m十七    ","\e[33m十八    ","\e[33m十九    ","\e[33m二十    ","\e[33m廿一    ","\e[33m廿二    ","\e[33m廿三    ","\e[33m廿四    ","\e[33m廿五    ","\e[33m廿六    ","\e[33m廿七    ","\e[33m廿八    ","\e[33m廿九    ","\e[33m三十    "},
*ChMonth0[] = {"   --   ","\e[31m正月     ","\e[31m二月     ","\e[31m三月     ","\e[31m四月     ","\e[31m五月     ","\e[31m六月     ","\e[31m七月     ","\e[31m八月     ","\e[31m九月     ","\e[31m十月     ","\e[31m冬月     ","\e[31m腊月     "},
*ChFestival[]={"        ","\e[32m寒食节  ","\e[32m春节🏮   ","\e[32m火神节  ","\e[32m元宵节  ","\e[32m龙头节  ","\e[32m上巳节  ","\e[32m端午节🍙 ","\e[32m天贶节  ","\e[32m七夕节💖 ","\e[32m中元节  ","\e[32m中秋节🌝 ","\e[32m重阳节  ","\e[32m寒衣节  ","\e[32m下元节  ","\e[32m腊八节  ","\e[32m祭灶节  ","\e[32m除夕    "},
*ChFestivalSolar[]={"        ","\e[36m复活节  ","\e[36m父亲节  ","\e[36m母亲节  ","\e[36m感恩节  ","\e[36m元旦    ","\e[36m情人节🌹 ","\e[36m妇女节  ","\e[36m植树节  ","\e[36m消权日  ","\e[36m愚人节  ","\e[36m劳动节  ","\e[36m青年节  ","\e[36m儿童节  ","\e[36m建党节  ","\e[36m建军节  ","\e[36m教师节  ","\e[36m国庆节  ","\e[36m万圣节🎃 ","\e[36m光棍节  ","\e[36m平安夜  ","\e[36m圣诞节🎄 "},
*ChConstellations[]={"摩羯座♑️","水瓶座♒️","双鱼座♓️","白羊座♈️","金牛座♉️","双子座♊️","巨蟹座♋️","狮子座♌️","处女座♍️","天秤座♎️","天蝎座♏️","射手座♐️"},
*ChMonthSize[]={"小","大"},
*ChAgo[]={"昨天","今天","明天","天后","天前"},
*ChAzimuth[]={"南","东","北","西"},
*ChTimeQuantum[]={"凌晨","早晨","上午","中午","下午","晚上","深夜"};
int monthTotal[13] = {0,31,59,90,120,151,181,212,243,273,304,334,365},
days[13]={0,31,28,31,30,31,30,31,31,30,31,30,31};
int LunarFestivalDate[]=
{0,101,107,115,202,303,505,606,707,715,815,909,1001,1015,1208,1223,1230},
 SolarFestivalDate[]=
{0,0,0,0,101,214,308,312,315,401,501,504,601,701,801,910,1001,1031,1111,1224,1225},
ConstellationsDate[]=
{1222,120,219,321,420,521,622,723,823,923,1024,1123,1222},
TimeQuantum[]={0,5,8,11,13,18,22};

void DrawFestivalTXT(int solarfestival,int lunarfestival)
{
	if (lunarfestival)
	{
		switch (lunarfestival)
		{
			case 9:
			gotoxy(20,20);
	    	printf("\e[36;1m>七夕 快乐<");
	   	 gotoxy(17,21);
    		printf("\e[0;41;37m夜幕垂 鹊桥会 七夕的念想 ");
	    	gotoxy(17,22);
	    	printf("皎月归 我轻随 烟火对影赏 ");
	    	gotoxy(16,23);
		    printf("小城老街上 有情人执手同徜徉\e[0;36;1m--许嵩<七夕>\e[0m\n");
		    break;
		    case 11:
		    gotoxy(20,20);
		    printf("\e[36;1m>中秋 共赏月<");
			gotoxy(19,21);
    		printf("\e[0;41;37m不应有恨 何时长向别时圆。 ");
	    	gotoxy(17,22);
    		printf("人有悲欢离合 月有阴晴圆缺 此事古难全。 ");
   	 	gotoxy(19,23);
	    	printf("但愿人长久 千里共婵娟\e[0;36;1m--苏轼<水调歌头>\e[0m\n");
		    break;
		}
	}
}
#endif